Autodesk.Revit.DB.Structure.ConnectionInputPoint.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.ConnectionInputPoint.Id
Unique id of this input point.
Since:
2021

Autodesk.Revit.DB.Structure.ConnectionInputPoint.Point
3d position of this input point.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.Structure.ConnectionInputPoint.#ctor(Autodesk.Revit.DB.XYZ)
Construct an input point from 3d point. A new valid id will be auto-generated.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.Structure.ConnectionInputPoint.#ctor(Autodesk.Revit.DB.XYZ,System.Guid)
Construct an input point from 3d point and id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.Structure.ConnectionInputPoint.#ctor
Construct a default input point.
Since:
2021

Autodesk.Revit.DB.Structure.ConnectionInputPoint
An object that holds information about a connection input point
Since:
2021